---
kind: type
id: T:Autodesk.Revit.DB.PlanViewRangeError
source: html/795ce613-6827-e526-23c5-0e60beb090b0.htm
---
# Autodesk.Revit.DB.PlanViewRangeError

Describes errors in the location of planes in a PlanViewRange object.

## Syntax (C#)
```csharp
public enum PlanViewRangeError
```